In [25]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/codebasics/py/master/ML/14_naive_bayes/titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [26]:
#data cleaning, collecting relavent independent data
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [27]:
#Convert Sex to one hot encoding
dummy = pd.get_dummies(df['Sex'])
df = pd.concat([df,dummy],axis='columns')
df.head()

   Pclass     Sex   Age     Fare  Survived  female  male
0       3    male  22.0   7.2500         0       0     1
1       1  female  38.0  71.2833         1       1     0
2       3  female  26.0   7.9250         1       1     0
3       1  female  35.0  53.1000         1       1     0
4       3    male  35.0   8.0500         0       0     1

In [28]:
input = df.drop(['Sex','female','Survived'],axis='columns')
target = df.Survived

In [29]:
#check if there are any NAN 
input.columns[input.isna().any()]

Index(['Age'], dtype='object')

In [30]:
#fill NAN
input.Age = input.Age.fillna(input.Age.mean())

In [31]:
input.columns[input.isna().any()]       # NO NAN values

Index([], dtype='object')

In [36]:
#splitting the dataset
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(input,target,test_size=0.2)

In [37]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(X_train,y_train)
model.score(X_test,y_test)

0.7374301675977654

In [40]:
#probability of occurance of each class
print(model.predict(X_test[:10]))
model.predict_proba(X_test[:10])

[1 1 1 0 0 0 1 0 0 0]

array([[0.04922509, 0.95077491],
       [0.36135772, 0.63864228],
       [0.02362   , 0.97638   ],
       [0.95386244, 0.04613756],
       [0.9263195 , 0.0736805 ],
       [0.88531318, 0.11468682],
       [0.42569272, 0.57430728],
       [0.77424017, 0.22575983],
       [0.96198545, 0.03801455],
       [0.96489764, 0.03510236]])